Revit 2024 API
ElectricalSystem.ApparentLoadPhaseA Property
 The ApparentLoadPhaseA value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double ApparentLoadPhaseA { get; }
Visual Basic
Public ReadOnly Property ApparentLoadPhaseA As Double
	Get
Visual C++
public:
property double ApparentLoadPhaseA {
	double get ();
}
Remarks
 This property is used to retrieve the ApparentLoadPhaseA value of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace